# ComputeDrivingCurves Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarContainerItem..::..ComputeDrivingCurves Method
RebarContainerItem Class See Also
---
Compute the driving curves.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public IList<Curve> ComputeDrivingCurves()
```

Visual Basic
---
```text
Public Function ComputeDrivingCurves As IList(Of Curve)
```

Visual C++
---
```text
public:
IList<Curve^>^ ComputeDrivingCurves()
```

# ### Return Value
Returns an empty array if an error is encountered.
# Remarks
The driving curves are the ones that appear in rebar sketch mode. They include lines and arcs that drive the shape, but exclude fillets and hooks. They always lie in a plane-- if the bar is 3D, these curves are a subset or a projection. They are also used for shape matching.
# See Also
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace